app/Controllers/Unidades.php

    public function index($activo = 1)
    {
        $unidades = $this->unidades->where('activo', $activo)->findAll();
---
SELECT *
FROM `unidades`
WHERE `activo` = 1

    public function eliminar($id)
    {
        //$this->unidades->delete($id,true);


        $this->unidades->update($id,['activo'=>'0']);
---
UPDATE `unidades` SET `activo` = '0', `fecha_edit` = '2023-08-26 04:48:24'
WHERE `unidades`.`id` IN ('5')